results/linux/concurrent_mid.txt
Running 1m test @ http://localhost:3000/concurrent
  8 threads and 200 connections
  Thread calibration: mean lat.: 1.258ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.276ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.285ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.323ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.325ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.329ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.350ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.351ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.68ms    4.20ms 151.68ms   98.95%
    Req/Sec   658.51    119.69     2.78k    82.22%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.30ms
 75.000%    1.80ms
 90.000%    2.26ms
 99.000%    6.64ms
 99.900%   67.97ms
 99.990%  118.85ms
 99.999%  147.58ms
100.000%  151.81ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.149     0.000000            1         1.00
       0.534     0.100000        25027         1.11
       0.723     0.200000        49936         1.25
       0.910     0.300000        74818         1.43
       1.103     0.400000        99773         1.67
       1.302     0.500000       124810         2.00
       1.400     0.550000       137225         2.22
       1.497     0.600000       149709         2.50
       1.592     0.650000       162119         2.86
       1.692     0.700000       174632         3.33
       1.798     0.750000       187029         4.00
       1.856     0.775000       193306         4.44
       1.919     0.800000       199539         5.00
       1.987     0.825000       205795         5.71
       2.065     0.850000       212084         6.67
       2.155     0.875000       218308         8.00
       2.205     0.887500       221363         8.89
       2.263     0.900000       224507        10.00
       2.327     0.912500       227634        11.43
       2.403     0.925000       230700        13.33
       2.503     0.937500       233846        16.00
       2.561     0.943750       235373        17.78
       2.633     0.950000       236908        20.00
       2.725     0.956250       238485        22.86
       2.843     0.962500       240018        26.67
       3.007     0.968750       241594        32.00
       3.117     0.971875       242363        35.56
       3.253     0.975000       243138        40.00
       3.421     0.978125       243916        45.71
       3.639     0.981250       244694        53.33
       3.939     0.984375       245475        64.00
       4.167     0.985938       245866        71.11
       4.559     0.987500       246251        80.00
       5.447     0.989062       246644        91.43
       7.811     0.990625       247031       106.67
      11.959     0.992188       247420       128.00
      14.679     0.992969       247615       142.22
      19.615     0.993750       247811       160.00
      22.879     0.994531       248005       182.86
      28.687     0.995313       248200       213.33
      34.303     0.996094       248394       256.00
      38.335     0.996484       248492       284.44
      42.815     0.996875       248589       320.00
      46.431     0.997266       248687       365.71
      49.439     0.997656       248785       426.67
      53.919     0.998047       248882       512.00
      55.967     0.998242       248931       568.89
      57.439     0.998437       248979       640.00
      60.575     0.998633       249028       731.43
      64.447     0.998828       249076       853.33
      68.479     0.999023       249125      1024.00
      71.871     0.999121       249149      1137.78
      74.815     0.999219       249174      1280.00
      76.927     0.999316       249200      1462.86
      82.687     0.999414       249223      1706.67
      86.975     0.999512       249249      2048.00
      87.807     0.999561       249259      2275.56
      91.263     0.999609       249272      2560.00
      96.255     0.999658       249283      2925.71
      99.967     0.999707       249295      3413.33
     103.999     0.999756       249308      4096.00
     106.239     0.999780       249314      4551.11
     107.647     0.999805       249320      5120.00
     110.783     0.999829       249326      5851.43
     113.087     0.999854       249332      6826.67
     115.647     0.999878       249338      8192.00
     116.223     0.999890       249341      9102.22
     119.743     0.999902       249344     10240.00
     123.583     0.999915       249347     11702.86
     125.887     0.999927       249350     13653.33
     126.719     0.999939       249353     16384.00
     129.343     0.999945       249355     18204.44
     129.407     0.999951       249356     20480.00
     130.495     0.999957       249358     23405.71
     131.583     0.999963       249359     27306.67
     133.503     0.999969       249361     32768.00
     133.631     0.999973       249362     36408.89
     133.631     0.999976       249362     40960.00
     134.399     0.999979       249363     46811.43
     145.023     0.999982       249364     54613.33
     147.199     0.999985       249365     65536.00
     147.199     0.999986       249365     72817.78
     147.199     0.999988       249365     81920.00
     147.583     0.999989       249366     93622.86
     147.583     0.999991       249366    109226.67
     149.887     0.999992       249367    131072.00
     149.887     0.999993       249367    145635.56
     149.887     0.999994       249367    163840.00
     149.887     0.999995       249367    187245.71
     149.887     0.999995       249367    218453.33
     151.807     0.999996       249368    262144.00
     151.807     1.000000       249368          inf
#[Mean    =        1.685, StdDeviation   =        4.201]
#[Max     =      151.680, Total count    =       249368]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  299792 requests in 1.00m, 40.88MB read
Requests/sec:   4996.41
Transfer/sec:    697.74KB