results/linux/db_high.txt
Running 1m test @ http://localhost:3000/db
  8 threads and 500 connections
  Thread calibration: mean lat.: 3.084ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 3.090ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 3.088ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 3.258ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 3.093ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 3.090ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 3.094ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 3.092ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     3.12ms  448.50us   6.71ms   67.53%
    Req/Sec     1.29k     0.90k    6.89k    87.71%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    3.12ms
 75.000%    3.41ms
 90.000%    3.69ms
 99.000%    4.30ms
 99.900%    4.84ms
 99.990%    5.50ms
 99.999%    6.11ms
100.000%    6.72ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       2.053     0.000000            1         1.00
       2.535     0.100000        50086         1.11
       2.711     0.200000        99468         1.25
       2.859     0.300000       149573         1.43
       2.993     0.400000       199114         1.67
       3.119     0.500000       248955         2.00
       3.179     0.550000       273534         2.22
       3.239     0.600000       298842         2.50
       3.295     0.650000       323104         2.86
       3.353     0.700000       347907         3.33
       3.413     0.750000       373000         4.00
       3.445     0.775000       385414         4.44
       3.481     0.800000       397878         5.00
       3.521     0.825000       410198         5.71
       3.569     0.850000       422732         6.67
       3.623     0.875000       434881         8.00
       3.655     0.887500       441373         8.89
       3.689     0.900000       447548        10.00
       3.727     0.912500       453730        11.43
       3.769     0.925000       459844        13.33
       3.817     0.937500       465871        16.00
       3.845     0.943750       469001        17.78
       3.877     0.950000       472217        20.00
       3.911     0.956250       475261        22.86
       3.951     0.962500       478348        26.67
       3.999     0.968750       481491        32.00
       4.025     0.971875       482954        35.56
       4.057     0.975000       484529        40.00
       4.091     0.978125       486041        45.71
       4.131     0.981250       487595        53.33
       4.179     0.984375       489189        64.00
       4.207     0.985938       489965        71.11
       4.239     0.987500       490736        80.00
       4.275     0.989062       491483        91.43
       4.315     0.990625       492257       106.67
       4.367     0.992188       493057       128.00
       4.399     0.992969       493440       142.22
       4.431     0.993750       493842       160.00
       4.467     0.994531       494210       182.86
       4.511     0.995313       494608       213.33
       4.559     0.996094       495001       256.00
       4.583     0.996484       495181       284.44
       4.607     0.996875       495364       320.00
       4.639     0.997266       495579       365.71
       4.667     0.997656       495753       426.67
       4.707     0.998047       495960       512.00
       4.723     0.998242       496042       568.89
       4.743     0.998437       496133       640.00
       4.771     0.998633       496240       731.43
       4.803     0.998828       496335       853.33
       4.843     0.999023       496429      1024.00
       4.863     0.999121       496473      1137.78
       4.895     0.999219       496523      1280.00
       4.923     0.999316       496571      1462.86
       4.963     0.999414       496617      1706.67
       5.007     0.999512       496667      2048.00
       5.047     0.999561       496692      2275.56
       5.075     0.999609       496715      2560.00
       5.115     0.999658       496741      2925.71
       5.143     0.999707       496764      3413.33
       5.203     0.999756       496789      4096.00
       5.231     0.999780       496799      4551.11
       5.263     0.999805       496812      5120.00
       5.315     0.999829       496824      5851.43
       5.383     0.999854       496836      6826.67
       5.451     0.999878       496848      8192.00
       5.483     0.999890       496854      9102.22
       5.515     0.999902       496861     10240.00
       5.559     0.999915       496866     11702.86
       5.587     0.999927       496872     13653.33
       5.643     0.999939       496878     16384.00
       5.667     0.999945       496881     18204.44
       5.687     0.999951       496884     20480.00
       5.711     0.999957       496888     23405.71
       5.727     0.999963       496890     27306.67
       5.775     0.999969       496893     32768.00
       5.819     0.999973       496895     36408.89
       5.839     0.999976       496896     40960.00
       5.867     0.999979       496898     46811.43
       5.887     0.999982       496899     54613.33
       5.991     0.999985       496901     65536.00
       6.055     0.999986       496902     72817.78
       6.055     0.999988       496902     81920.00
       6.115     0.999989       496903     93622.86
       6.491     0.999991       496904    109226.67
       6.583     0.999992       496905    131072.00
       6.583     0.999993       496905    145635.56
       6.583     0.999994       496905    163840.00
       6.655     0.999995       496906    187245.71
       6.655     0.999995       496906    218453.33
       6.691     0.999996       496907    262144.00
       6.691     0.999997       496907    291271.11
       6.691     0.999997       496907    327680.00
       6.691     0.999997       496907    374491.43
       6.691     0.999998       496907    436906.67
       6.715     0.999998       496908    524288.00
       6.715     1.000000       496908          inf
#[Mean    =        3.123, StdDeviation   =        0.448]
#[Max     =        6.712, Total count    =       496908]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  597633 requests in 1.00m, 103.73MB read
Requests/sec:   9955.99
Transfer/sec:      1.73MB